[
  {
    "name": "General: Actividades",
    "speeches": [
      {
        "title": "Conferencia magistral",
        "slug": null,
        "speaker": "Memo D枚ring",
        "abstract": "Acomp谩帽anos a la conferencia magistral de Memo D枚ring, Head of Developer Relations LATAM en AWS para descubrir como la nube est谩 transformando las organizaciones de todos los sectores y tama帽os.",
        "start": "09:30",
        "end": "10:30"
      },
      {
        "title": "AWS Certification Lounge - Cloud Practitioner",
        "slug": null,
        "speaker": "Sala P3 - Gilberto Canales 拆",
        "abstract": "隆nete a nuestra sesi贸n de entrenamiento AWS Cloud Practitioner! En 45 minutos, sum茅rgete en los conceptos clave de AWS y la nube. Aprende sobre servicios, casos de uso, beneficios de AWS y tambi茅n conoce las herramientas disponibles para que te puedas preparar de la mejor manera y logres certificarte como AWS Certified Cloud Practitioner. Participa en la sesi贸n de preguntas y respuestas. 隆Todos los niveles son bienvenidos! 隆Te esperamos para aprender!",
        "start": "11:00",
        "end": "11:45"
      },
      {
        "title": "Almuerzo",
        "slug": null,
        "speaker": "Expo",
        "abstract": "Acomp谩帽anos a comer en el transcurso del d铆a. Toma tu box lunch, si茅ntate, rel谩jate y disfruta de tus alimentos en la expo o en alguna sala. Por favor, tira tu basura en el bote m谩s cercano.",
        "start": "13:00",
        "end": "14:00"
      },
      {
        "title": "AWS Certification Lounge - Solutions Architect",
        "slug": null,
        "speaker": "Sala P3 - Gilberto Canales 拆",
        "abstract": "隆No te pierdas nuestra sesi贸n de taller para la certificaci贸n AWS Solutions Architect Associate! En 45 minutos aprende sobre las habilidades que son requeridas para dise帽ar arquitecturas en AWS. Aprende sobre mejores pr谩cticas, patrones de dise帽o y servicios clave. Participa en la sesi贸n de preguntas y respuestas. No importa si eres nuevo o tienes experiencia, 隆todos son bienvenidos! nete a nosotros para una sesi贸n enriquecedora y la oportunidad de aprender de los mejores mientras te preparas para la certificaci贸n AWS Solutions Architect Associate. 隆Te esperamos!",
        "start": "14:00",
        "end": "14:45"
      },
      {
        "title": "AWS Certification Lounge - Cloud Practitioner",
        "slug": null,
        "speaker": "Sala P3 - Gilberto Canales 拆",
        "abstract": "隆nete a nuestra sesi贸n de entrenamiento AWS Cloud Practitioner! En 45 minutos, sum茅rgete en los conceptos clave de AWS y la nube. Aprende sobre servicios, casos de uso, beneficios de AWS y tambi茅n conoce las herramientas disponibles para que te puedas preparar de la mejor manera y logres certificarte como AWS Certified Cloud Practitioner. Participa en la sesi贸n de preguntas y respuestas. 隆Todos los niveles son bienvenidos! 隆Te esperamos para aprender!",
        "start": "17:00",
        "end": "17:45"
      },
      {
        "title": "Fotograf铆a grupal",
        "slug": null,
        "speaker": "Sala principal",
        "abstract": "Justo antes de iniciar la sesi贸n de cierre y networking, acomp谩namos a tomar la foto grupal del evento.",
        "start": "18:00",
        "end": "19:00"
      },
      {
        "title": "Networking de cierre",
        "slug": null,
        "speaker": "Expo",
        "abstract": "Acomp谩帽anos a brindar el cierre de un exitoso evento y a conectar con otras personas interesadas en la nube.",
        "start": "19:00",
        "end": "20:00"
      }
    ]
  },
  {
    "name": "Primeros Pasos en la Nube",
    "speeches": [
      {
        "title": "Transf贸rmate en el mejor junior",
        "slug": "PPN102",
        "speaker": "Franco Martin ",
        "abstract": "Ya consegui mi primer trabajo, 驴y ahora? En esta charla les voy a contar algunos principios que les van a ayudar a crecer y prepararse para dar el pr贸ximo paso en su carrera profesional.",
        "start": "11:50",
        "end": "12:35"
      },
      {
        "title": "Explorando la Nube, primeros pasos de la Transformaci贸n Digital",
        "slug": "PPN106",
        "speaker": "Arturo Gallart 拆",
        "abstract": "En esta charla, exploraremos c贸mo la adopci贸n de la nube puede impulsar nuestras estrategias de transformaci贸n digital. Descubriremos tanto los beneficios como los desaf铆os que nos esperan en estos primeros pasos hacia la nube y en este viaje hacia un futuro m谩s 谩gil, eficiente y mejor conectado",
        "start": "12:40",
        "end": "13:25"
      },
      {
        "title": "隆A toda marcha! Tu primera p谩gina web con AWS Amplify",
        "slug": "PPN201",
        "speaker": "Heberto Cordero 拆",
        "abstract": "Imagina poder construir y desplegar p谩ginas web no solo de manera r谩pida, sino tambi茅n de manera divertida y sencilla, hoy mismo puedes tener tu propia p谩gina web en menos de 30 minutos, digamos adios, a los m茅todos tradicionales y demos la bienvenida a AWS Amplify",
        "start": "13:30",
        "end": "14:15"
      },
      {
        "title": "Comienzos en la nube como estudiante",
        "slug": "PPN103",
        "speaker": "Diego Antonio Lopez Ruelas 拆 y Cristian Salazar Bautista 拆",
        "abstract": "驴Tienes inter茅s en el mundo que AWS ofrece, pero tienes dudas sobre si vale la pena o no sabes qu茅 es AWS? En nuestra charla mencionaremos lo que puedes esperar de este mundo tan maravilloso, lo grande que es esta comunidad y el c贸mo aprender sobre AWS puede ayudarte en tu carrera como estudiante",
        "start": "14:20",
        "end": "15:05"
      },
      {
        "title": "Convirti茅ndome en un super PRO en el campo",
        "slug": "PPN104",
        "speaker": "Sergio Macias 拆",
        "abstract": "Ya terminaste tu carrera y te preguntas 驴qu茅 sigue? 驴No es muy claro en que debes de enfocarte?, 隆esta charla es para ti!",
        "start": "15:10",
        "end": "16:00"
      },
      {
        "title": "Construyendo aplicaciones web escalables: Usando un enfoque serverless e infraestructura como c贸digo con CDK",
        "slug": "PPN202",
        "speaker": "J眉rgen Anders Guerra Ramos 叼",
        "abstract": "En esta ponencia, exploraremos el fascinante mundo de la construcci贸n de aplicaciones web en AWS. Para ello aprenderemos c贸mo adoptar un enfoque serverless utilizando servicios como Lambda, S3 o DynamoDB, as铆 como desplegar nuestra infraestructura como c贸digo (IaC) utilizando AWS CDK",
        "start": "16:05",
        "end": "16:50"
      },
      {
        "title": "Entendiendo CI/CD desde la base",
        "slug": "PPN105",
        "speaker": "Marcos Cespere ",
        "abstract": "驴Cu谩ntas veces escuchamos CI/CD? 驴Es un buzzword o un concepto real? Voy a explicar de que se trata, que metodolog铆as de trabajo lo soportan e impulsan y que tecnolog铆as podemos aplicar para alcanzar su aplicaci贸n. Adem谩s de la teor铆a, veremos buenas practicas para mejorar el trabajo en equipo.",
        "start": "16:55",
        "end": "17:40"
      }
    ]
  },
  {
    "name": "Operaciones en la Nube",
    "speeches": [
      {
        "title": "Usar Lambda@Edge para habilitar pruebas canario, balanceo de cargas y despliegues verde/azul en Amazon CloudFront",
        "slug": "OEN301",
        "speaker": "David Sol 拆",
        "abstract": "A trav茅s de Lambda@Edge desarrollamos un mecanismo para hacer pruebas canario, balanceo de cargas y despliegues verde/azul con dos or铆genes distintos para la misma distribuci贸n de Amazon CloudFront. Hablaremos a detalle de los retos t茅cnicos y como los superamos para resolver este requerimiento",
        "start": "11:00",
        "end": "11:45"
      },
      {
        "title": "De c贸digo a la nube: Optimiza tu CI/CD para tus aplicaciones serverless",
        "slug": "OEN201",
        "speaker": "Andr茅s Moreno 拆 吼",
        "abstract": "Como optimizar tu CI/CD para hacer verificaciones pre-despliegue (pruebas unitarias, linting, etc.), desplegar la aplicaci贸n con IaC y hacer validaciones post-despliegue (pruebas de contrato, de integraci贸n, etc.) y ver como usar los mismos flujos para crear ambientes ef铆meros para los desarrolladores",
        "start": "11:50",
        "end": "12:35"
      },
      {
        "title": "Dominando Terraform: Escalabilidad y Flexibilidad en AWS",
        "slug": "OEN202",
        "speaker": "Edgar Omar Reyes Cano 拆",
        "abstract": "En esta charla, te presentar茅 parte de mi aprendizaje trabajando con AWS y Terraform. Descubre c贸mo una metodolog铆a escalable y adaptable puede facilitar tu forma de trabajar. Con una demo, aprender谩s c贸mo esta metodolog铆a simplifica la colaboraci贸n y prepara el terreno para ir evolucionando tu IaC",
        "start": "12:40",
        "end": "13:25"
      },
      {
        "title": "Protegiendo tus aplicaciones durante el ciclo de vida de desarrollo",
        "slug": "OEN203",
        "speaker": "David Avila ",
        "abstract": "Por definir",
        "start": "14:20",
        "end": "15:05"
      },
      {
        "title": "Consejos de optimizaci贸n y rendimiento de AWS Lambda",
        "slug": "OEN204",
        "speaker": "Lino Espinoza 叼",
        "abstract": "Voy a hablar sobre c贸mo optimizar adecuadamente las funciones Lambda para obtener y mejorar el rendimiento, a trav茅s de conceptos importantes sobre c贸mo funciona AWS Lambda y consejos que surgen de la experiencia pr谩ctica",
        "start": "15:10",
        "end": "16:00"
      },
      {
        "title": "Adoptar Kubernetes de forma sencilla con EKS Blueprints",
        "slug": "OEN205",
        "speaker": "Alonso Parasxidis Moreno 拆",
        "abstract": "Esta charla trata sobre c贸mo tener un cl煤ster de Kubernetes personalizable y listo para producci贸n desde cero utilizando una herramienta respaldada por la comunidad y comenzar a implementar sus cargas de trabajo utilizando pr谩cticas de GitOps, as铆 como a administrar complementos, que le permitir谩n ampliar las capacidades funcionales de su cl煤ster",
        "start": "16:05",
        "end": "16:50"
      },
      {
        "title": "Patrones avanzados de IAM, llevando AWS mas all谩 de la nube con IAM Anywhere y Amazon Verified Permissons",
        "slug": "OEN302",
        "speaker": "Franchesco Romero y Luis Ordaz 拆",
        "abstract": "Experiencias y estrategias para llevar IAM m谩s all谩 de los servicios de AWS. Ya sea integrando IAM de AWS con otros proveedores de nube o creando un sistema unificado de gesti贸n de identidad en redes privadas. Asi como la creacion de un ambiente Zero-Trust usando Amazon Verified Permissions",
        "start": "16:55",
        "end": "17:40"
      }
    ]
  },
  {
    "name": "AI/ML",
    "speeches": [
      {
        "title": "Potenciando a Alexa con AWS: Explorando la Magia detr谩s Amazon Alexa",
        "slug": "AIM201",
        "speaker": "Ethel Emmelaine Gonz谩lez S谩nchez 拆",
        "abstract": "Descubre c贸mo maximizar el potencial de Alexa mediante AWS. Exploraremos c贸mo servicios como Lambda, S3 y DynamoDB pueden fortalecer las capacidades de tu asistente virtual y brindar experiencias m谩s enriquecedoras a los usuarios",
        "start": "11:00",
        "end": "11:45"
      },
      {
        "title": "驴Y qu茅 diablos es Gen AI y c贸mo lo integro con AWS?",
        "slug": "AIM101",
        "speaker": "Fabiana Serangelli 拆 火",
        "abstract": "nete a la pr贸xima ola de innovaci贸n tecnol贸gica con Gen AI en AWS. Aprende qu茅 es Gen AI y descubre c贸mo lo podemos integrar con las herramientas disponibles de Machine Learning en AWS",
        "start": "11:50",
        "end": "12:35"
      },
      {
        "title": "Hadoop: HDFS y la propuesta de AWS",
        "slug": "AIM205",
        "speaker": "Ismael Porto 拆",
        "abstract": "驴Alguna vez se ha preguntado c贸mo las grandes empresas almacenan grandes cantidades de datos manteniendo al mismo tiempo un rendimiento 贸ptimo en sus aplicaciones? Hadoop es la respuesta. Gracias a su enfoque de almacenar grandes cantidades de datos en hardware rentable, varias empresas lo han adoptado como su soluci贸n de big data",
        "start": "12:40",
        "end": "13:25"
      },
      {
        "title": "Generaci贸n del eCommerce desde cero hasta la IA",
        "slug": "AIM202",
        "speaker": "Ivan Casta帽eda 拆",
        "abstract": "隆Revolucionario Caso de xito en Log铆stica para eCommerce! Desde la creaci贸n que va de la asignaci贸n de pedidos hasta la recolecci贸n y entrega puntual al cliente, para dar inicio a la revoluci贸n con Inteligencia Artificial. 隆Eleva tu log铆stica a un nuevo nivel!",
        "start": "13:30",
        "end": "14:15"
      },
      {
        "title": "Impulsando la Productividad del Desarrollador con Amazon CodeWhisperer",
        "slug": "AIM102",
        "speaker": "Marco Cornejo 拆",
        "abstract": "Descubre c贸mo impulsar tu productividad con Amazon CodeWhisperer, la herramienta basada en IA Generativa de AWS. Exploraremos sugerencias de c贸digo en tiempo real, superaci贸n de desaf铆os con APIs y fortalecimiento de la seguridad. 隆Lleva tu desarrollo al siguiente nivel con el poder de la IA!",
        "start": "14:20",
        "end": "15:05"
      },
      {
        "title": "DevOps Runbooks usando Jupyter notebooks en AWS Sagemaker",
        "slug": "AIM203",
        "speaker": "Yslen Gonz谩lez 拆",
        "abstract": "En DevOps se trabaja con scripts de automatizaci贸n con diferentes prop贸sitos. 驴Pero qu茅 pasa cuando no se tiene una gu铆a comprensible de lo que se necesita para ejecutarlos? Con Jupyter notebooks se puede colaborar de mejor manera y sobre todo, obtener mejor visibilidad de los outputs en cada paso",
        "start": "15:10",
        "end": "16:00"
      },
      {
        "title": "Potenciando los LLMs con RAG y Atlas Vector Search",
        "slug": "AIM301",
        "speaker": "H茅ctor Daniel Rodr铆guez Arreola 拆",
        "abstract": "Los LLMs han catalizado una era de innovaci贸n, permiti茅ndonos elevar los productos tecnol贸gicos a niveles que rozan lo m谩gico. A pesar de su impacto transformador, estos modelos no est谩n libres de desaf铆os y se enfrentan a limitaciones como alucinaciones, informaci贸n desactualizada, la falta de acceso a datos espec铆ficos de los usuarios, y l铆mites en el procesamiento de tokens. En esta presentaci贸n, descubrir谩s c贸mo las arquitecturas de Retrieval-Augmented Generation (RAG) y MongoDB Atlas Vector Search est谩n trazando nuevos horizontes para los LLMs, evolucionando hacia modelos de lenguaje m谩s precisos, conscientes del contexto y din谩micos",
        "start": "16:05",
        "end": "16:50"
      }
    ]
  },
  {
    "name": "Mejores Pr谩cticas en la Nube",
    "speeches": [
      {
        "title": "驴C贸mo transformar tu empresa en Cloud Native?",
        "slug": "MPN201",
        "speaker": "Franco Martin ",
        "abstract": "",
        "start": "11:00",
        "end": "11:45"
      },
      {
        "title": "Aplicando Housekeeping en AWS",
        "slug": "MPN202",
        "speaker": "Franco Martin ",
        "abstract": "",
        "start": "11:50",
        "end": "12:35"
      },
      {
        "title": "PPN102 - Transf贸rmate en el mejor junior",
        "slug": "PPN105",
        "speaker": "Franco Martin ",
        "abstract": "",
        "start": "12:40",
        "end": "13:25"
      },
      {
        "title": "PPN102 - Transf贸rmate en el mejor junior",
        "slug": "PPN105",
        "speaker": "Franco Martin ",
        "abstract": "",
        "start": "14:20",
        "end": "15:05"
      },
      {
        "title": "PPN102 - Transf贸rmate en el mejor junior",
        "slug": "PPN105",
        "speaker": "Franco Martin ",
        "abstract": "",
        "start": "15:10",
        "end": "16:00"
      },
      {
        "title": "PPN102 - Transf贸rmate en el mejor junior",
        "slug": "PPN105",
        "speaker": "Franco Martin ",
        "abstract": "",
        "start": "16:05",
        "end": "16:50"
      },
      {
        "title": "PPN102 - Transf贸rmate en el mejor junior",
        "slug": "PPN105",
        "speaker": "Franco Martin ",
        "abstract": "",
        "start": "16:55",
        "end": "17:40"
      }
    ]
  }
]